Revit 2026 API

# RenderingSettings Methods

---

The RenderingSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBackgroundSettings | Returns an object that represents the rendering background settings. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRenderingImageExposureSettings | Returns an object that represents the rendering image exposure settings. |
|  | GetRenderingQualitySettings | Returns an object that represents the rendering quality settings. |
|  | GetRenderingRegionOutline | Returns the outline of the rendering region. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetBackgroundSettings | Changes the rendering background settings details for the current background style. |
|  | SetRenderingImageExposureSettings | Changes the rendering image exposure settings. |
|  | SetRenderingQualitySettings | Change rendering quality settings. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace